levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_usart.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup USART_Global_Functions
 * @{
 */

/**
 * @brief  Enable USART noise filter.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_EnableNoiseFilter(M4_USART_TypeDef *USARTx)
{
    SET_REG32_BIT(USARTx->CR1, USART_CR1_NFE);
}

/**
 * @brief  Disable USART noise filter.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_DisableNoiseFilter(M4_USART_TypeDef *USARTx)
{
    CLEAR_REG32_BIT(USARTx->CR1, USART_CR1_NFE);
}

/**
 * @brief  Enable UART multiple processor function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_EnableMultProcessor(M4_USART_TypeDef *USARTx)
{
    SET_REG32_BIT(USARTx->CR2, USART_CR2_MPE);
}

/**
 * @brief  Disable UART multiple processor function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_DisableMultProcessor(M4_USART_TypeDef *USARTx)
{
    CLEAR_REG32_BIT(USARTx->CR2, USART_CR2_MPE);
}

/**
 * @brief  USART receive data.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 * @retval Receive data
 */
__STATIC_INLINE uint16_t USART_RecData(M4_USART_TypeDef *USARTx)
{
    return (uint16_t)(READ_REG32(USARTx->DR) >> USART_DR_RDR_POS);
}

/**
 * @brief  USART send data.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 ** \param [in] u16Data                 Transmit data
 * @retval None
 */
__STATIC_INLINE void USART_SendData(M4_USART_TypeDef *USARTx,
                                            uint16_t u16Data)
{
    WRITE_REG32(USARTx->DR,  ((uint32_t)u16Data & 0x01FFUL));
}

/**
 * @brief  USART send processor ID.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_USART1:            USART unit 1 instance register base
 *           @arg M4_USART2:            USART unit 2 instance register base
 *           @arg M4_USART3:            USART unit 3 instance register base
 *           @arg M4_USART4:            USART unit 4 instance register base
 ** \param [in] u16ID                   Processor ID
 * @retval None
 */
__STATIC_INLINE void USART_SendId(M4_USART_TypeDef *USARTx,
                                        uint16_t u16ID)
{
    WRITE_REG32(USARTx->DR, (USART_DR_MPID | ((uint32_t)u16ID & 0x01FFUL)));
}

en_result_t USART_UartInit(M4_USART_TypeDef *USARTx,
                            const stc_uart_init_t *pstcInit);
en_result_t USART_HalfDuplexInit(M4_USART_TypeDef *USARTx,
                                            const stc_uart_init_t *pstcInit);
en_result_t USART_UartStructInit(stc_uart_init_t *pstcInit);
en_result_t USART_MultiProcessorInit(M4_USART_TypeDef *USARTx,
                                const stc_uart_multiprocessor_init_t *pstcInit);
en_result_t UART_MultiProcessorStructInit(stc_uart_multiprocessor_init_t *pstcInit);
en_result_t USART_ClkSyncInit(M4_USART_TypeDef *USARTx,
                                        const stc_clksync_init_t *pstcInit);
en_result_t USART_ClkSyncStructInit(stc_clksync_init_t *pstcInit);
en_result_t USART_DeInit(M4_USART_TypeDef *USARTx);

en_result_t USART_FuncCmd(M4_USART_TypeDef *USARTx,
                            uint32_t u32Func,
                            en_functional_state_t enNewSta);
en_functional_state_t USART_GetFuncState(M4_USART_TypeDef *USARTx,
                            uint32_t u32Func);
en_flag_status_t USART_GetFlag(M4_USART_TypeDef *USARTx,
                                        uint32_t u32Flag);
en_result_t USART_SilenceModeCmd(M4_USART_TypeDef *USARTx, en_functional_state_t enNewSta);
en_functional_state_t USART_GetSilenceModeState(M4_USART_TypeDef *USARTx);
en_result_t USART_ClearFlag(M4_USART_TypeDef *USARTx, uint32_t u32Flag);
en_result_t USART_SetTransmissionType(M4_USART_TypeDef *USARTx,
                                            uint32_t u32Type);
uint32_t USART_GetTransmissionType(M4_USART_TypeDef *USARTx);
en_result_t USART_SetParity(M4_USART_TypeDef *USARTx, uint32_t u32Parity);
uint32_t USART_GetParity(M4_USART_TypeDef *USARTx);
en_result_t USART_SetDataWidth(M4_USART_TypeDef *USARTx,
                                    uint32_t u32DataWidth);
uint32_t USART_GetDataWidth(M4_USART_TypeDef *USARTx);
en_result_t USART_SetOversmaplingBits(M4_USART_TypeDef *USARTx,
                                            uint32_t u32OversamplingBits);
uint32_t USART_GetOversmaplingBits(M4_USART_TypeDef *USARTx);
en_result_t USART_SetMode(M4_USART_TypeDef *USARTx, uint32_t u32Mode);
uint32_t USART_GetMode(M4_USART_TypeDef *USARTx);
en_result_t USART_SetBitDirection(M4_USART_TypeDef *USARTx,
                                        uint32_t u32BitDir);
uint32_t USART_GetBitDirection(M4_USART_TypeDef *USARTx);
en_result_t USART_SetSbDetectPolarity(M4_USART_TypeDef *USARTx,
                                            uint32_t u32Polarity);
uint32_t USART_GetSbDetectPolarity(M4_USART_TypeDef *USARTx);
en_result_t USART_SetClockMode(M4_USART_TypeDef *USARTx, uint32_t u32ClkMode);
uint32_t USART_GetClockMode(M4_USART_TypeDef *USARTx);
en_result_t USART_SetStopBits(M4_USART_TypeDef *USARTx, uint32_t u32StopBits);
uint32_t USART_GetStopBits(M4_USART_TypeDef *USARTx);
en_result_t USART_SetDuplexMode(M4_USART_TypeDef *USARTx,
                                uint32_t u32Mode);
uint32_t USART_GetDuplexMode(M4_USART_TypeDef *USARTx);
en_result_t USART_SetHwFlowCtrl(M4_USART_TypeDef *USARTx,
                                uint32_t u32HwFlowCtrl);
uint32_t USART_GetHwFlowCtrl(M4_USART_TypeDef *USARTx);
en_result_t USART_SetClkPrescaler(M4_USART_TypeDef *USARTx,
                                    uint32_t u32PrescalerDiv);
uint32_t USART_GetClkPrescaler(M4_USART_TypeDef *USARTx);

en_result_t USART_SetBaudrate(M4_USART_TypeDef *USARTx,
                                    uint32_t u32Baudrate,
                                    float32_t *pf32Err);

/**
 * @}
 */

#endif /* DDL_USART_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_USART_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
